УправлениеВетеринарнойКлиникой/src/DataProcessors/ВыгрузкаСотрудниковВАрхив/ВыгрузкаСотрудниковВАрхив.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВыгрузкаСотрудниковВАрхив</name>
</mdclass:DataProcessor>

УправлениеВетеринарнойКлиникой/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Должность</name>
    <type>
      <types>EnumRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Фото</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧасоваяСтавка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

УправлениеВетеринарнойКлиникой/src/DataProcessors/ВыгрузкаСотрудниковВАрхив/ObjectModule.bsl
Функция ПодготовитьАрхив() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕ(Сотрудники.Должность) КАК Должность,
		|	ПРЕДСТАВЛЕНИЕ(Сотрудники.Ссылка) КАК Сотрудник,
		|	ПРЕДСТАВЛЕНИЕ(Сотрудники.Телефон) КАК Телефон,
		|	ПРЕДСТАВЛЕНИЕ(Сотрудники.Email) КАК Email,
		|	ПРЕДСТАВЛЕНИЕ(Сотрудники.ИдентификаторПользователяИБ) КАК Идентификатор,
		|	Сотрудники.Фото КАК Фото
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.ЭтоГруппа = ЛОЖЬ";
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	ИмяКаталога = ПолучитьИмяВременногоФайла("");
	СоздатьКаталог(ИмяКаталога);
	
	ОписаниеСотрудников = Новый Массив;
	
	ШаблонИмениКартинки = "%1%2img%2%3.jpg";
	
	Пока Выборка.Следующий() Цикл
		
		ОписаниеСотрудника = Новый Структура;
		ОписаниеСотрудника.Вставить("Идентификатор", Выборка.Идентификатор);
		ОписаниеСотрудника.Вставить("Сотрудник", Выборка.Сотрудник);
		ОписаниеСотрудника.Вставить("Должность", Выборка.Должность);
		ОписаниеСотрудника.Вставить("Телефон", Выборка.Телефон);
		ОписаниеСотрудника.Вставить("Email", Выборка.Email);
		
		ДанныеФото = Выборка.Фото.Получить();
		
		Если ДанныеФото = Неопределено Тогда
			ОписаниеСотрудника.Вставить("Фото", Неопределено);
		Иначе
			ИмяФайла = СтрШаблон(ШаблонИмениКартинки, ИмяКаталога, ПолучитьРазделительПути(), Выборка.Идентификатор);
			ДанныеФото.Записать(ИмяФайла);
			ОписаниеСотрудника.Вставить("Фото", СтрШаблон(ШаблонИмениКартинки, "", ПолучитьРазделительПути(), Выборка.Идентификатор));
		КонецЕсли;
		
		ОписаниеСотрудников.Добавить(ОписаниеСотрудника);
		
	КонецЦикла;
	
	ШаблонИмениФайлаВыгрузки = "%1%2export.json";
	ИмяФайлаВыгрузки = СтрШаблон(ШаблонИмениФайлаВыгрузки, ИмяКаталога, ПолучитьРазделительПути());
	
	Запись = Новый ЗаписьJSON();
	Запись.ОткрытьФайл(ИмяФайлаВыгрузки);
	ЗаписатьJSON(Запись, ОписаниеСотрудников);
	Запись.Закрыть();
	
	Архиватор = Новый ЗаписьZipФайла;
	Архиватор.Добавить(ИмяКаталога + ПолучитьРазделительПути() + "*.*",,РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
	ДанныеАрхива = Архиватор.ПолучитьДвоичныеДанные();
	
	
	
	УдалитьФайлы(ИмяКаталога);
	
	Возврат ПоместитьВоВременноеХранилище(ДанныеАрхива)

КонецФункции
